# V2 Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PolymeshFacet..::..V2 Property
PolymeshFacet Class See Also
---
The second vertex of the facet
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public int V2 { get; }
```

Visual Basic
---
```text
Public ReadOnly Property V2 As Integer
	Get
```

Visual C++
---
```text
public:
property int V2 {
	int get ();
}
```

# ### Field Value
An index of a vertex of a polymesh.
# See Also
PolymeshFacet Class
Autodesk.Revit.DB Namespace